test/requests/update_or_create_payee_info_success_invalid_req.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap12:Envelope xmlns:soap12="http://www.w3.org/2003/05/soap-envelope" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soap12:Body>
    <UpdateOrCreatePayeeInfo xmlns="http://Tipalti.org/">
      <payerName>MyPayer</payerName>
      <timestamp>1521234048</timestamp>
      <key>084f466bee44118421b6660d25ecc0f6c3a0c0ca5b7118b97c116f4e095a6733</key>
      <idap>invalidname</idap>
      <skipNulls>true</skipNulls>
      <overridePayableCountry>false</overridePayableCountry>
      <item>
        <FirstName>José</FirstName>
        <LastName>Valim</LastName>
      </item>
    </UpdateOrCreatePayeeInfo>
  </soap12:Body>
</soap12:Envelope>
